---
kind: property
id: P:Autodesk.Revit.DB.Transform2D.Origin
zh: 原点
source: html/5204635c-1eea-58b4-4b75-4cb8b1e04c33.htm
---
# Autodesk.Revit.DB.Transform2D.Origin Property

**中文**: 原点

The image of (0, 0) under OfPoint(UV) .
 This defines the translational part of the transform.

## Syntax (C#)
```csharp
public UV Origin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null